org/blog/_posts/2016-01-03-building-shared-world.org
#+startup: showall 
#+PROPERTY: cache yes
#+PROPERTY: results output
#+PROPERTY: cache yes
#+OPTIONS: toc:nil
#+PROPERTY: exports code
#+BEGIN_HTML
---
layout: post
published: true
title: "Building a shared world: Mapping distributional to model-theoretic semantic spaces"
tags:
 - article
---
#+END_HTML

The introduction of this papers is fascinating. The complementarity
mentioned in the introduction has been in my mind for a while:

#+BEGIN_QUOTE
In recent years, the complementarity of distributional and formal
semantics has become increasingly evident... A number of proposals
have emerged from these considerations, suggesting that an overarching
semantics integrating both distributional and formal aspects would be
desirable...
#+END_QUOTE

Another interesting part of the paper is its section 4.2, when the
authors introduce their definition of 'model-theoretic spaces':

#+BEGIN_QUOTE
Ontologies can be represented in various ways, but in this paper, we
assume they are formalised in terms of sets of entities... In our
account, we do not have an a priori model of the world: we wish to
infer it from our observation of language data
#+END_QUOTE

In the next paragraphs, the authors precisely defined their
'model-theoretic spaces'. The article is worth to reading.


#+BEGIN_SRC bibtex
  @InProceedings{herbelot-vecchi:2015:EMNLP,
      author    = {Herbelot, Aur\'{e}lie  and  Vecchi, Eva Maria},
      title     = {Building a shared world: mapping distributional to
                      model-theoretic semantic spaces},
      booktitle = {Proceedings of the 2015 Conference on Empirical Methods
                      in Natural Language Processing},
      month     = {September},
      year      = {2015},  address   = {Lisbon, Portugal},
      publisher = {Association for Computational Linguistics},
      pages     = {22--32},
      url       = {http://aclweb.org/anthology/D15-1003}
  }
#+END_SRC


