jekyll/blog/_posts/2016-01-03-building-shared-world.html
---
layout: post
published: true
title: "Building a shared world: Mapping distributional to model-theoretic semantic spaces"
tags:
 - article
---

<p>
The introduction of this papers is fascinating. The complementarity
mentioned in the introduction has been in my mind for a while:
</p>

<blockquote>
<p>
In recent years, the complementarity of distributional and formal
semantics has become increasingly evident&#x2026; A number of proposals
have emerged from these considerations, suggesting that an overarching
semantics integrating both distributional and formal aspects would be
desirable&#x2026;
</p>
</blockquote>

<p>
Another interesting part of the paper is its section 4.2, when the
authors introduce their definition of 'model-theoretic spaces':
</p>

<blockquote>
<p>
Ontologies can be represented in various ways, but in this paper, we
assume they are formalised in terms of sets of entities&#x2026; In our
account, we do not have an a priori model of the world: we wish to
infer it from our observation of language data
</p>
</blockquote>

<p>
In the next paragraphs, the authors precisely defined their
'model-theoretic spaces'. The article is worth to reading.
</p>


<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #0000ff;">@InProceedings</span>{<span style="color: #008b8b;">herbelot-vecchi:2015:EMNLP</span>,
    <span style="color: #a0522d;">author</span>    = {Herbelot, Aur\'{e}lie  and  Vecchi, Eva Maria},
    <span style="color: #a0522d;">title</span>     = {Building a shared world: mapping distributional to
                    model-theoretic semantic spaces},
    <span style="color: #a0522d;">booktitle</span> = {Proceedings of the 2015 Conference on Empirical Methods
                    in Natural Language Processing},
    <span style="color: #a0522d;">month</span>     = {September},
    <span style="color: #a0522d;">year</span>      = {2015},  address   = {Lisbon, Portugal},
    <span style="color: #a0522d;">publisher</span> = {Association for Computational Linguistics},
    <span style="color: #a0522d;">pages</span>     = {22--32},
    <span style="color: #a0522d;">url</span>       = {<span style="color: #3a5fcd; text-decoration: underline;">http://aclweb.org/anthology/D15-1003</span>}
}
</pre>
</div>
